Revit 2024 API
OverrideGraphicSettings.SetSurfaceForegroundPatternColor Method
 Sets the override color of the surface foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public OverrideGraphicSettings SetSurfaceForegroundPatternColor(
	Color color
)
Visual Basic
Public Function SetSurfaceForegroundPatternColor ( _
	color As Color _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetSurfaceForegroundPatternColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 Value of the surface foreground color for the override. InvalidColorValue means no override is set.
Return Value
 Reference to the changed object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace